feat: add all-services mode
